In [7]:
import pandas as pd

job_postings_fact = pd.read_csv('C:\\Users\\ethan\\Downloads\\job_postings_fact.csv')
company_dim = pd.read_csv('C:\\Users\\ethan\\[OLD] Python Projects\\SQL_Projects\\all_folders\\csv_files\\company_dim.csv')
skills_dim = pd.read_csv("C:\\Users\\ethan\\[OLD] Python Projects\\SQL_Projects\\all_folders\\csv_files\\skills_dim.csv")
skills_jobs_dim = pd.read_csv("C:\\Users\\ethan\\[OLD] Python Projects\\SQL_Projects\\all_folders\\csv_files\\skills_job_dim.csv")

In [26]:
job_postings_fact.head()

,job_id,company_id,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg
0,0,0,Data Analyst,Marketing Data Analyst,Anywhere,via LinkedIn,Full-time,True,Serbia,2023-09-25 17:46:06,False,False,Serbia,NaN,NaN,NaN
1,55,1,Cloud Engineer,Storage and Virtualization Engineer,"Kuwait City, Kuwait",via Trabajo.org,Full-time,False,Kuwait,2023-07-30 17:49:18,True,False,Kuwait,NaN,NaN,NaN
2,66,2,Data Analyst,Data Analyst et Scientist F/H,"Paris, France",via Emplois Trabajo.org,Full-time,False,France,2023-07-28 17:28:01,False,False,France,NaN,NaN,NaN
3,76,3,Data Engineer,Data Engineer,"Denver, CO",via LinkedIn,Contractor,False,"Illinois, United States",2023-04-03 17:14:45,False,False,United States,hour,NaN,70.0
4,81,4,Data Engineer,Data Engineer,Anywhere,via LinkedIn,Contractor,True,Canada,2023-03-25 17:25:20,False,False,Canada,NaN,NaN,NaN

In [29]:
job_postings_fact = job_postings_fact.dropna(subset=['salary_year_avg'])

job_postings_fact_UK = job_postings_fact[job_postings_fact["job_country"] == "United Kingdom"]

job_postings_fact_UK.sort_values(["salary_year_avg"], ascending=False) [['job_id','job_title','job_country','salary_year_avg']]

,job_id,job_title,job_country,salary_year_avg
436534,1540095,Head of Data Engineering,United Kingdom,249000.0
192494,565034,Real World Data Science Manager,United Kingdom,205000.0
352705,1812962,Deep Learning Research Engineer,United Kingdom,200000.0
366607,401338,Data Science Manager,United Kingdom,192000.0
45606,97173,Data Science Manager,United Kingdom,192000.0
...,...,...,...,...
580008,57239,Data Scientist,United Kingdom,31500.0
326564,450632,"Senior Director, Head of Business Intelligence",United Kingdom,30000.0
170861,1185135,Data Analyst,United Kingdom,30000.0
149524,265915,Analyste en intelligence d'affaires (hybride)/...,United Kingdom,30000.0
147303,196993,Data and Systems Analyst HODSA001,United Kingdom,30000.0